app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    @urls = Url.all

INSERT INTO "urls" ("created_at", "long_url", "num_views", "short_url", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 09 Nov 2012 01:17:59 UTC +00:00], ["long_url", "http://facebook.com"], ["num_views", nil], ["short_url", "5iN"], ["updated_at", Fri, 09 Nov 2012 01:17:59 UTC +00:00]]
---
  def create
    @user = current_user
    @url = @user.urls.build(params[:url])

    if @url.save

SELECT "urls".* FROM "urls" WHERE "urls"."short_url" IS NULL LIMIT 1
UPDATE "urls" SET "num_views" = 1 WHERE "urls"."id" = 10
---
  def show
    @url = Url.find_by_short_url(params[:short_url])
    @url.increment!(:num_views)

SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 16]]
---
  def destroy
    @url = Url.find(params[:id])
    @url.destroy